aqandu/cc3200-firmware/src/main.c
	}

	return SUCCESS;
}

//****************************************************************************
//
//!    \brief Read Force AP GPIO and Configure Mode - 1(Access Point Mode)
//!                                                  - 0 (Station Mode)
//!
//! \return                        None
//
//****************************************************************************
static void ReadDeviceConfiguration() {
	unsigned int uiGPIOPort;
	unsigned char pucGPIOPin;
	unsigned char ucPinValue;

	// Read GPIO
	GPIO_IF_GetPortNPin(SH_GPIO_3, &uiGPIOPort, &pucGPIOPin);
	ucPinValue = GPIO_IF_Get(SH_GPIO_3, uiGPIOPort, pucGPIOPin);

	// If Connected to VCC, Mode is AP
	if (ucPinValue == 1) {
		// AP Mode
		g_uiDeviceModeConfig = ROLE_AP;

	} else {
		// STA Mode
		g_uiDeviceModeConfig = ROLE_STA;

	}

}

//****************************************************************************
//
//!    \brief HTTP Server Application Main Task - Initializes SimpleLink Driver and
//!                                              Handles HTTP Requests
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void NetworkConfigTask(void *pvParameters) {
	long lRetVal = -1;

	ReadDeviceConfiguration();

	lRetVal = ConnectToNetwork();
	if (lRetVal < 0) {
		GPIO_IF_LedOn(MCU_STAT_3_LED_GPIO);
		osi_Sleep(500);
		GPIO_IF_LedOff(MCU_STAT_3_LED_GPIO);
	}

}

//****************************************************************************
//
//!    \brief DataGather Application Task - Samples the sensors every 1 minute.
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void DataGatherTask(void *pvParameters) {
	long lRetVal = -1;

	TickType_t xLastWakeTime;
	const TickType_t xFreq = 5000; // 60 seconds

	xLastWakeTime = xTaskGetTickCount();

	float temperature;
	float humidity;
	float light;
	int pm01;
	int pm2_5;
	int pm10;
	unsigned char pm_buf[24];

	int i = 0;
	while (1) {
		GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);
		vTaskDelayUntil(&xLastWakeTime, xFreq);
		GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);

		// Gather i2c sensor data
		I2C_IF_Open(I2C_MASTER_MODE_FST);
		ConfigureOPT3001Mode();
		light = GetOPT3001Result();
		I2C_IF_Close(I2C_MASTER_MODE_FST);

		I2C_IF_Open(I2C_MASTER_MODE_FST);
		ConfigureHDC1080Mode();
		temperature = GetTemperature();
		humidity = GetHumidity();
		I2C_IF_Close(I2C_MASTER_MODE_FST);

		if (light > 0) {
			GPIO_IF_LedOn(MCU_STAT_2_LED_GPIO);
		} else {
			GPIO_IF_LedOn(MCU_STAT_3_LED_GPIO);
		}

		UART_PRINT("l: %f, t: %f, h: %h\r\n", light, temperature, humidity);

		//GetPMS3003Result(pm_buf);

		// Gather uart sensor data
		//TODO GPS

		pm01 = GetPM01(pm_buf);
		pm2_5 = GetPM2_5(pm_buf);
		pm10 = GetPM10(pm_buf);

		char *csv = (char*) malloc(50 * sizeof(char));
		sprintf(csv, "%d,%f,%f,%f,%d,%d,%d\r\n", i++, temperature, humidity,
				light, pm01, pm2_5, pm10);
		int btw = strlen(csv);

		//TODO create file for each new day using GPS
		// this will propose a problem though if date doesnt get set
		f_mount(&fs, "", 0);
		/* Open or create a log file and ready to append */
		res = f_append(&fp, FILE);
		if (res == FR_OK) {
			/* Append a line */
			res = f_write(&fp, csv, btw, &Size);
			/* Close the file */
			res = f_close(&fp);

		} else {
			//Message("Failed to create a new file\n\r");
		}
		free(csv);

	}
}

//****************************************************************************
//
//!    \brief DataUpload Application Task - Uploads collected data every 90 minutes.
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void DataUploadTask(void *pvParameters)
{
	TickType_t xLastWakeTime;
	const TickType_t xFreq = 1000; // 1 minute

	xLastWakeTime = xTaskGetTickCount();

	int i = 0;
	while (1)
	{
		vTaskDelayUntil(&xLastWakeTime, xFreq);

		// Write over UART
		UART_PRINT("Upload Task %d\r\n", i++);
	}
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void BoardInit(void) {

	// Set vector table base
#if defined(ccs) || defined(gcc)
	MAP_IntVTableBaseSet((unsigned long) &g_pfnVectors[0]);
#endif
#if defined(ewarm)
	MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif

	// Enable Processor
	MAP_IntMasterEnable();
	MAP_IntEnable(FAULT_SYSTICK);

	PRCMCC3200MCUInit();
}

static void SDInit() {
	//
	// Set the SD card clock as output pin
	//
	MAP_PinDirModeSet(PIN_07, PIN_DIR_MODE_OUT);

	//
	// Enable Pull up on data
	//
	MAP_PinConfigSet(PIN_06, PIN_STRENGTH_4MA, PIN_TYPE_STD_PU);

	//
	// Enable Pull up on CMD
	//
	MAP_PinConfigSet(PIN_08, PIN_STRENGTH_4MA, PIN_TYPE_STD_PU);

	//
	// Enable MMCHS
	//
	MAP_PRCMPeripheralClkEnable(PRCM_SDHOST, PRCM_RUN_MODE_CLK);

	//
	// Reset MMCHS
	//
	MAP_PRCMPeripheralReset(PRCM_SDHOST);

	//
	// Configure MMCHS
	//
	MAP_SDHostInit(SDHOST_BASE);

	//
	// Configure card clock
	//
	MAP_SDHostSetExpClk(SDHOST_BASE, MAP_PRCMPeripheralClockGet(PRCM_SDHOST),
			15000000);

}

//****************************************************************************
//
//! Reboot the MCU by requesting hibernate for a short duration
//!
//! \return None
//
//****************************************************************************
static void RebootMCU() {

	//
	// Configure hibernate RTC wakeup
	//
	PRCMHibernateWakeupSourceEnable(PRCM_HIB_SLOW_CLK_CTR);

	//
	// Delay loop
	//
	MAP_UtilsDelay(8000000);

	//
	// Set wake up time
	//
	PRCMHibernateIntervalSet(330);

	//
	// Request hibernate
	//
	PRCMHibernateEnter();

	//
	// Control should never reach here
	//
	while (1) {

	}
}

void main() {

	long lRetVal = -1;

	// Board Initialization
	BoardInit();

	// Configure the pinmux settings for the peripherals exercised
	PinMuxConfig();

	PinConfigSet(PIN_58, PIN_STRENGTH_2MA | PIN_STRENGTH_4MA, PIN_TYPE_STD_PD);

	// Initialize Global Variables
	InitializeAppVariables();

	// Can't have both the Term and PMS
	InitTerm();
	//InitPMS();

	// uSD Init
	SDInit();

	DisplayBanner("airu");

	// LED Init
	GPIO_IF_LedConfigure(LED1);
	GPIO_IF_LedConfigure(LED2);
	GPIO_IF_LedConfigure(LED3);

	// Turn Off the LEDs
	GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);
	GPIO_IF_LedOff(MCU_STAT_2_LED_GPIO);
	GPIO_IF_LedOff(MCU_STAT_3_LED_GPIO);
	//GPIO_IF_LedOn(MCU_STAT_2_LED_GPIO);

	// Simplelink Spawn Task
	lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
	if (lRetVal < 0) {
		ERR_PRINT(lRetVal);
		LOOP_FOREVER()
		;
	}

	Report("Entering Network Config Task\r\n");
	osi_TaskCreate(NetworkConfigTask, (signed char*) "NetworkConfigTask",
4096, NULL,
	NETWORK_CONFIG_TASK_PRIORITY, NULL);

	// Create the DataGather Task
    osi_TaskCreate(DataGatherTask, (signed char*)"DataGatherTask",
    		OSI_STACK_SIZE, NULL, DATAGATHER_TASK_PRIORITY, NULL);

	// Create the DataUpload Task
    osi_TaskCreate(DataUploadTask, (signed char*)"DataUploadTask",
        						 OSI_STACK_SIZE, NULL, DATAUPLOAD_TASK_PRIORITY, NULL);

	// Start OS Scheduler
	osi_start();

	while (1) {

	}

}
